import { useEffect } from 'react';
import { DATE, NAME } from '../Setting/config';
import './main.less';

const Terms = () => {
	useEffect(() => {}, []);
	return (
		<div className='Terms'>
			<h2>{NAME} 使用條款</h2>
			<h4>{DATE}生效</h4>
			<p>
				請在使用本平台前仔細閱讀本使用條款。在任何電腦、手機、平板電腦、控制台或者其他裝備（以下統稱“裝備”）上使用本網站、行動應用程式，即表明您已經閱讀、理解並同意受本使用條款和其他適用法律約束。
				{NAME} 有權在任何時間不經通知修改本使用條款，並於公布在本平台之時起生效。
				您如持續使用本平台，即視為接受本使用條款的修訂。如果您不同意本使用條款，請勿使用本平台。
			</p>
			<p>
				本隱私政策旨在描述 {NAME}{' '}
				普遍的隱私作業，為了讓您能夠安心的使用本網站的各項服務與資訊，特此向您說明本網站的隱私權保護政策，以保障您的權益，請您詳閱下列內容：
			</p>
			<h3>一、智慧財產權</h3>
			<p>
				本平台全部智慧財產權（使用者產生內容除外）為 {NAME}{' '}
				或其授權人所有，包括受著作權、商標或專利法保護的材料。本平台全部內容（除使用者產生內容外），包括但不限於文字、軟體、腳本、代碼、設計、圖示、圖片、聲音、音樂、錄影、應用、互動功能和其他所有內容（以下簡稱“內容”）均為中華民國（台灣）和其他國家著作權法下的合法著作，並由原權利人享有著作權利，嚴禁使用／誤用本平台之任何內容。
			</p>
			<h3>二、平台使用限制</h3>
			<p>
				您只能為您自己的非商業用途使用或參與本平台之內容。您同意不修改或刪除任何您下載從本平台的資料或列印的資料上的所有權聲明。您同意未經{' '}
				{NAME}{' '}
				事先書面同意，不得改變、複製、翻譯、廣播、演出、展示、散布、塑造、生產、再版、下載、發表、傳輸或銷售任何本平台上出現的智慧財產權或內容，包括使用者產生內容（見下述定義），但是您自己合法發布於本平台的使用者產生內容除外。您同意不使用任何數據挖掘、機器人、數據抓取或類似的數據收集方法。本使用條款中任何內容不應被解釋為授予您任何智慧財產權。
			</p>
			<h3>三、傳輸</h3>
			<p>
				所有您經由電子郵件或其他方式傳輸至本網站的非個人通信或資料，包含所有資料、問題、評論、建議或其他相似內容，均將視為非機密與非私人資料。您同意不會傳送任何非法、侵害他人名譽、隱私權、營業秘密、商標權、著作權、專利權、其他智慧財產權及其他權利的物件給我們。
			</p>
			<p>
				您上傳或發表於本平台的所有您個人的設計物、營業機密、產品訊息等資料，提供給 {NAME}{' '}
				，即表示您已經授權 {NAME}
			</p>
			<p>
				可免費使用，但不是專屬獨佔使用，並可以逕自散布、出版、傳送、改作、發行、公開發表、進行還原工程、解編、反向組譯，或者以公開或商業的目的，使用您提供的任何內容。
				上述所有相關使用，提供資訊者將放棄要求任何補償。當您提供資訊時，即保證所提供之資訊／內容為您本人所有，且不會涉及誹謗，亦保證{' '}
				{NAME} 使用該資訊不會侵害任何第三方的權利或違反任何適用法。
			</p>
			<h3>四、兒童及未成年者之保護</h3>
			<p>
				為確保兒童及青少年使用網路的安全，並避免隱私權受到侵犯，當未成年者瀏覽網際網路時，家長（或監護人）應盡到監護義務。我們建議：未成年者須先取得監護人的同意，再決定是否同意登錄相關的個人資料；並應持續叮嚀兒童及青少年不可洩漏自己或家人的任何資料。
			</p>
			<h3>五、連結至其他網站</h3>
			<p>
				{NAME} 提供之連結可能會使您離開Facebook的網路或系統，{NAME}{' '}
				對於第三方網站的內容、功能或正確性，概不負責。 {NAME}{' '}
				係基於善意提供連結，但不負責連結網站（第三方網站）日後的任何變更。我們建議您仔細閱讀所有您造訪網站之法律與隱私權聲明。
			</p>
			<h3>六、保證與免責聲明</h3>
			<p>您將自行承擔使用本網站之一切風險。</p>
			<p>
				我們不保證本網站不會出現中斷或故障等現象，也無法保證本網站不會遭病毒或其他有害物件侵害，或許將造成您使用上的不便、資料喪失、錯誤、遭人篡改或其他損失等情形。
			</p>
			<p>
				若您因使用、存取或下載本網站任何資料，而導致您的電腦設備或其他財產感染病毒，其所生之任何損失，
				{NAME} 概無任何義務或責任。請您於使用本網站時，宜自行採取防護措施。
			</p>
			<p>
				且於適用法允許之最大範圍內，您同意放棄因使用或進入本網站所生之任何損害，而向 {NAME}{' '}
				及其主管、董事、員工、供應商及電腦程式人員，請求損害賠償之權利。
			</p>
			<h3>七、cookie使用</h3>
			<p>
				為了便利使用者，本網站可能使用 Cookie 技術，以便於提供更適合使用者個人需要的服務；Cookie
				是網站伺候器用來和使用者瀏覽器進行溝通的一種技術，它可能在使用者的電腦中儲存某些資訊，但是使用者可以經由瀏覽器的設定，取消或限制此項功能。
			</p>
		</div>
	);
};
export default Terms;
